---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.DetachElements
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.DetachElements

Defines a resolution of a failure by removing invalid relationships between elements such as joined
 walls and roofs, grouped elements, and associated curves.